Revit 2027 API
BuiltInFailures.OpeningFailures.OpeningRemovesHost Property
 Opening completely removes its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpeningRemovesHost { get; }
Public Shared ReadOnly Property OpeningRemovesHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpeningRemovesHost {
	FailureDefinitionId^ get ();
}
static member OpeningRemovesHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace